{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 3, 224, 224], "input_dtype": "float32", "sparse": false, "name": "data"}, "inbound_nodes": [], "name": "data"}, {"class_name": "ZeroPadding2D", "config": {"padding": [3, 3], "trainable": true, "name": "conv1/7x7_s2_zeropadding"}, "inbound_nodes": [[["data", 0, 0]]], "name": "conv1/7x7_s2_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv1/7x7_s2", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 7, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [2, 2], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 7}, "inbound_nodes": [[["conv1/7x7_s2_zeropadding", 0, 0]]], "name": "conv1/7x7_s2"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv1/relu_7x7"}, "inbound_nodes": [[["conv1/7x7_s2", 0, 0]]], "name": "conv1/relu_7x7"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "pool1/3x3_s2_zeropadding"}, "inbound_nodes": [[["conv1/relu_7x7", 0, 0]]], "name": "pool1/3x3_s2_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "pool1/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["pool1/3x3_s2_zeropadding", 0, 0]]], "name": "pool1/3x3_s2"}, {"class_name": "LRN2D", "config": {"alpha": 0.0001, "k": 1, "beta": 0.75, "n": 5}, "inbound_nodes": [[["pool1/3x3_s2", 0, 0]]], "name": "pool1/norm1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool1/norm1", 0, 0]]], "name": "conv2/3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2/relu_3x3_reduce"}, "inbound_nodes": [[["conv2/3x3_reduce", 0, 0]]], "name": "conv2/relu_3x3_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "conv2/3x3_zeropadding"}, "inbound_nodes": [[["conv2/relu_3x3_reduce", 0, 0]]], "name": "conv2/3x3_zeropadding"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "conv2/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["conv2/3x3_zeropadding", 0, 0]]], "name": "conv2/3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "conv2/relu_3x3"}, "inbound_nodes": [[["conv2/3x3", 0, 0]]], "name": "conv2/relu_3x3"}, {"class_name": "LRN2D", "config": {"alpha": 0.0001, "k": 1, "beta": 0.75, "n": 5}, "inbound_nodes": [[["conv2/relu_3x3", 0, 0]]], "name": "conv2/norm2"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "pool2/3x3_s2_zeropadding"}, "inbound_nodes": [[["conv2/norm2", 0, 0]]], "name": "pool2/3x3_s2_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "pool2/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["pool2/3x3_s2_zeropadding", 0, 0]]], "name": "pool2/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3a/relu_3x3_reduce"}, "inbound_nodes": [[["inception_3a/3x3_reduce", 0, 0]]], "name": "inception_3a/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3a/relu_5x5_reduce"}, "inbound_nodes": [[["inception_3a/5x5_reduce", 0, 0]]], "name": "inception_3a/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_3a/pool_zeropadding"}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_3a/3x3_zeropadding"}, "inbound_nodes": [[["inception_3a/relu_3x3_reduce", 0, 0]]], "name": "inception_3a/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_3a/5x5_zeropadding"}, "inbound_nodes": [[["inception_3a/relu_5x5_reduce", 0, 0]]], "name": "inception_3a/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_3a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_3a/pool_zeropadding", 0, 0]]], "name": "inception_3a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool2/3x3_s2", 0, 0]]], "name": "inception_3a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_3a/3x3_zeropadding", 0, 0]]], "name": "inception_3a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_3a/5x5_zeropadding", 0, 0]]], "name": "inception_3a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3a/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_3a/pool", 0, 0]]], "name": "inception_3a/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3a/relu_1x1"}, "inbound_nodes": [[["inception_3a/1x1", 0, 0]]], "name": "inception_3a/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3a/relu_3x3"}, "inbound_nodes": [[["inception_3a/3x3", 0, 0]]], "name": "inception_3a/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3a/relu_5x5"}, "inbound_nodes": [[["inception_3a/5x5", 0, 0]]], "name": "inception_3a/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3a/relu_pool_proj"}, "inbound_nodes": [[["inception_3a/pool_proj", 0, 0]]], "name": "inception_3a/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_3a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_3a/relu_1x1", 0, 0], ["inception_3a/relu_3x3", 0, 0], ["inception_3a/relu_5x5", 0, 0], ["inception_3a/relu_pool_proj", 0, 0]]], "name": "inception_3a/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3b/relu_3x3_reduce"}, "inbound_nodes": [[["inception_3b/3x3_reduce", 0, 0]]], "name": "inception_3b/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3b/relu_5x5_reduce"}, "inbound_nodes": [[["inception_3b/5x5_reduce", 0, 0]]], "name": "inception_3b/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_3b/pool_zeropadding"}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_3b/3x3_zeropadding"}, "inbound_nodes": [[["inception_3b/relu_3x3_reduce", 0, 0]]], "name": "inception_3b/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_3b/5x5_zeropadding"}, "inbound_nodes": [[["inception_3b/relu_5x5_reduce", 0, 0]]], "name": "inception_3b/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_3b/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_3b/pool_zeropadding", 0, 0]]], "name": "inception_3b/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_3a/output", 0, 0]]], "name": "inception_3b/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_3b/3x3_zeropadding", 0, 0]]], "name": "inception_3b/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_3b/5x5_zeropadding", 0, 0]]], "name": "inception_3b/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_3b/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_3b/pool", 0, 0]]], "name": "inception_3b/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3b/relu_1x1"}, "inbound_nodes": [[["inception_3b/1x1", 0, 0]]], "name": "inception_3b/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3b/relu_3x3"}, "inbound_nodes": [[["inception_3b/3x3", 0, 0]]], "name": "inception_3b/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3b/relu_5x5"}, "inbound_nodes": [[["inception_3b/5x5", 0, 0]]], "name": "inception_3b/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_3b/relu_pool_proj"}, "inbound_nodes": [[["inception_3b/pool_proj", 0, 0]]], "name": "inception_3b/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_3b/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_3b/relu_1x1", 0, 0], ["inception_3b/relu_3x3", 0, 0], ["inception_3b/relu_5x5", 0, 0], ["inception_3b/relu_pool_proj", 0, 0]]], "name": "inception_3b/output"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "pool3/3x3_s2_zeropadding"}, "inbound_nodes": [[["inception_3b/output", 0, 0]]], "name": "pool3/3x3_s2_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "pool3/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["pool3/3x3_s2_zeropadding", 0, 0]]], "name": "pool3/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 96, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 16, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4a/relu_3x3_reduce"}, "inbound_nodes": [[["inception_4a/3x3_reduce", 0, 0]]], "name": "inception_4a/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4a/relu_5x5_reduce"}, "inbound_nodes": [[["inception_4a/5x5_reduce", 0, 0]]], "name": "inception_4a/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4a/pool_zeropadding"}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4a/3x3_zeropadding"}, "inbound_nodes": [[["inception_4a/relu_3x3_reduce", 0, 0]]], "name": "inception_4a/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_4a/5x5_zeropadding"}, "inbound_nodes": [[["inception_4a/relu_5x5_reduce", 0, 0]]], "name": "inception_4a/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_4a/pool_zeropadding", 0, 0]]], "name": "inception_4a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 192, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool3/3x3_s2", 0, 0]]], "name": "inception_4a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 208, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_4a/3x3_zeropadding", 0, 0]]], "name": "inception_4a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 48, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_4a/5x5_zeropadding", 0, 0]]], "name": "inception_4a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4a/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4a/pool", 0, 0]]], "name": "inception_4a/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4a/relu_1x1"}, "inbound_nodes": [[["inception_4a/1x1", 0, 0]]], "name": "inception_4a/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4a/relu_3x3"}, "inbound_nodes": [[["inception_4a/3x3", 0, 0]]], "name": "inception_4a/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4a/relu_5x5"}, "inbound_nodes": [[["inception_4a/5x5", 0, 0]]], "name": "inception_4a/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4a/relu_pool_proj"}, "inbound_nodes": [[["inception_4a/pool_proj", 0, 0]]], "name": "inception_4a/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4a/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4a/relu_1x1", 0, 0], ["inception_4a/relu_3x3", 0, 0], ["inception_4a/relu_5x5", 0, 0], ["inception_4a/relu_pool_proj", 0, 0]]], "name": "inception_4a/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 112, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4b/relu_3x3_reduce"}, "inbound_nodes": [[["inception_4b/3x3_reduce", 0, 0]]], "name": "inception_4b/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4b/relu_5x5_reduce"}, "inbound_nodes": [[["inception_4b/5x5_reduce", 0, 0]]], "name": "inception_4b/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4b/pool_zeropadding"}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4b/3x3_zeropadding"}, "inbound_nodes": [[["inception_4b/relu_3x3_reduce", 0, 0]]], "name": "inception_4b/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_4b/5x5_zeropadding"}, "inbound_nodes": [[["inception_4b/relu_5x5_reduce", 0, 0]]], "name": "inception_4b/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4b/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_4b/pool_zeropadding", 0, 0]]], "name": "inception_4b/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 160, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4a/output", 0, 0]]], "name": "inception_4b/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 224, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_4b/3x3_zeropadding", 0, 0]]], "name": "inception_4b/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_4b/5x5_zeropadding", 0, 0]]], "name": "inception_4b/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4b/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4b/pool", 0, 0]]], "name": "inception_4b/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4b/relu_1x1"}, "inbound_nodes": [[["inception_4b/1x1", 0, 0]]], "name": "inception_4b/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4b/relu_3x3"}, "inbound_nodes": [[["inception_4b/3x3", 0, 0]]], "name": "inception_4b/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4b/relu_5x5"}, "inbound_nodes": [[["inception_4b/5x5", 0, 0]]], "name": "inception_4b/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4b/relu_pool_proj"}, "inbound_nodes": [[["inception_4b/pool_proj", 0, 0]]], "name": "inception_4b/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4b/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4b/relu_1x1", 0, 0], ["inception_4b/relu_3x3", 0, 0], ["inception_4b/relu_5x5", 0, 0], ["inception_4b/relu_pool_proj", 0, 0]]], "name": "inception_4b/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4b/output", 0, 0]]], "name": "inception_4c/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 24, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4b/output", 0, 0]]], "name": "inception_4c/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4c/relu_3x3_reduce"}, "inbound_nodes": [[["inception_4c/3x3_reduce", 0, 0]]], "name": "inception_4c/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4c/relu_5x5_reduce"}, "inbound_nodes": [[["inception_4c/5x5_reduce", 0, 0]]], "name": "inception_4c/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4c/pool_zeropadding"}, "inbound_nodes": [[["inception_4b/output", 0, 0]]], "name": "inception_4c/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4c/3x3_zeropadding"}, "inbound_nodes": [[["inception_4c/relu_3x3_reduce", 0, 0]]], "name": "inception_4c/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_4c/5x5_zeropadding"}, "inbound_nodes": [[["inception_4c/relu_5x5_reduce", 0, 0]]], "name": "inception_4c/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4c/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_4c/pool_zeropadding", 0, 0]]], "name": "inception_4c/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4b/output", 0, 0]]], "name": "inception_4c/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_4c/3x3_zeropadding", 0, 0]]], "name": "inception_4c/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_4c/5x5_zeropadding", 0, 0]]], "name": "inception_4c/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4c/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4c/pool", 0, 0]]], "name": "inception_4c/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4c/relu_1x1"}, "inbound_nodes": [[["inception_4c/1x1", 0, 0]]], "name": "inception_4c/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4c/relu_3x3"}, "inbound_nodes": [[["inception_4c/3x3", 0, 0]]], "name": "inception_4c/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4c/relu_5x5"}, "inbound_nodes": [[["inception_4c/5x5", 0, 0]]], "name": "inception_4c/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4c/relu_pool_proj"}, "inbound_nodes": [[["inception_4c/pool_proj", 0, 0]]], "name": "inception_4c/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4c/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4c/relu_1x1", 0, 0], ["inception_4c/relu_3x3", 0, 0], ["inception_4c/relu_5x5", 0, 0], ["inception_4c/relu_pool_proj", 0, 0]]], "name": "inception_4c/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 144, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4d/relu_3x3_reduce"}, "inbound_nodes": [[["inception_4d/3x3_reduce", 0, 0]]], "name": "inception_4d/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4d/relu_5x5_reduce"}, "inbound_nodes": [[["inception_4d/5x5_reduce", 0, 0]]], "name": "inception_4d/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4d/pool_zeropadding"}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4d/3x3_zeropadding"}, "inbound_nodes": [[["inception_4d/relu_3x3_reduce", 0, 0]]], "name": "inception_4d/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_4d/5x5_zeropadding"}, "inbound_nodes": [[["inception_4d/relu_5x5_reduce", 0, 0]]], "name": "inception_4d/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4d/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_4d/pool_zeropadding", 0, 0]]], "name": "inception_4d/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 112, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4c/output", 0, 0]]], "name": "inception_4d/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 288, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_4d/3x3_zeropadding", 0, 0]]], "name": "inception_4d/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_4d/5x5_zeropadding", 0, 0]]], "name": "inception_4d/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4d/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 64, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4d/pool", 0, 0]]], "name": "inception_4d/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4d/relu_1x1"}, "inbound_nodes": [[["inception_4d/1x1", 0, 0]]], "name": "inception_4d/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4d/relu_3x3"}, "inbound_nodes": [[["inception_4d/3x3", 0, 0]]], "name": "inception_4d/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4d/relu_5x5"}, "inbound_nodes": [[["inception_4d/5x5", 0, 0]]], "name": "inception_4d/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4d/relu_pool_proj"}, "inbound_nodes": [[["inception_4d/pool_proj", 0, 0]]], "name": "inception_4d/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4d/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4d/relu_1x1", 0, 0], ["inception_4d/relu_3x3", 0, 0], ["inception_4d/relu_5x5", 0, 0], ["inception_4d/relu_pool_proj", 0, 0]]], "name": "inception_4d/output"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 160, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4e/relu_3x3_reduce"}, "inbound_nodes": [[["inception_4e/3x3_reduce", 0, 0]]], "name": "inception_4e/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4e/relu_5x5_reduce"}, "inbound_nodes": [[["inception_4e/5x5_reduce", 0, 0]]], "name": "inception_4e/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4e/pool_zeropadding"}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_4e/3x3_zeropadding"}, "inbound_nodes": [[["inception_4e/relu_3x3_reduce", 0, 0]]], "name": "inception_4e/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_4e/5x5_zeropadding"}, "inbound_nodes": [[["inception_4e/relu_5x5_reduce", 0, 0]]], "name": "inception_4e/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_4e/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_4e/pool_zeropadding", 0, 0]]], "name": "inception_4e/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4d/output", 0, 0]]], "name": "inception_4e/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 320, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_4e/3x3_zeropadding", 0, 0]]], "name": "inception_4e/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_4e/5x5_zeropadding", 0, 0]]], "name": "inception_4e/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_4e/pool_proj", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["inception_4e/pool", 0, 0]]], "name": "inception_4e/pool_proj"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4e/relu_1x1"}, "inbound_nodes": [[["inception_4e/1x1", 0, 0]]], "name": "inception_4e/relu_1x1"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4e/relu_3x3"}, "inbound_nodes": [[["inception_4e/3x3", 0, 0]]], "name": "inception_4e/relu_3x3"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4e/relu_5x5"}, "inbound_nodes": [[["inception_4e/5x5", 0, 0]]], "name": "inception_4e/relu_5x5"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_4e/relu_pool_proj"}, "inbound_nodes": [[["inception_4e/pool_proj", 0, 0]]], "name": "inception_4e/relu_pool_proj"}, {"class_name": "Merge", "config": {"name": "inception_4e/output", "concat_axis": 1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["inception_4e/relu_1x1", 0, 0], ["inception_4e/relu_3x3", 0, 0], ["inception_4e/relu_5x5", 0, 0], ["inception_4e/relu_pool_proj", 0, 0]]], "name": "inception_4e/output"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "pool4/3x3_s2_zeropadding"}, "inbound_nodes": [[["inception_4e/output", 0, 0]]], "name": "pool4/3x3_s2_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "pool4/3x3_s2", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [2, 2], "border_mode": "valid"}, "inbound_nodes": [[["pool4/3x3_s2_zeropadding", 0, 0]]], "name": "pool4/3x3_s2"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/3x3_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 160, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/3x3_reduce"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/5x5_reduce", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 32, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/5x5_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_5a/relu_3x3_reduce"}, "inbound_nodes": [[["inception_5a/3x3_reduce", 0, 0]]], "name": "inception_5a/relu_3x3_reduce"}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "inception_5a/relu_5x5_reduce"}, "inbound_nodes": [[["inception_5a/5x5_reduce", 0, 0]]], "name": "inception_5a/relu_5x5_reduce"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_5a/pool_zeropadding"}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/pool_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [1, 1], "trainable": true, "name": "inception_5a/3x3_zeropadding"}, "inbound_nodes": [[["inception_5a/relu_3x3_reduce", 0, 0]]], "name": "inception_5a/3x3_zeropadding"}, {"class_name": "ZeroPadding2D", "config": {"padding": [2, 2], "trainable": true, "name": "inception_5a/5x5_zeropadding"}, "inbound_nodes": [[["inception_5a/relu_5x5_reduce", 0, 0]]], "name": "inception_5a/5x5_zeropadding"}, {"class_name": "MaxPooling2D", "config": {"name": "inception_5a/pool", "trainable": true, "dim_ordering": "th", "pool_size": [3, 3], "strides": [1, 1], "border_mode": "valid"}, "inbound_nodes": [[["inception_5a/pool_zeropadding", 0, 0]]], "name": "inception_5a/pool"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/1x1", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 1, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 256, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 1}, "inbound_nodes": [[["pool4/3x3_s2", 0, 0]]], "name": "inception_5a/1x1"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/3x3", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 3, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 320, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 3}, "inbound_nodes": [[["inception_5a/3x3_zeropadding", 0, 0]]], "name": "inception_5a/3x3"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/5x5", "border_mode": "valid", "activation": "linear", "trainable": true, "nb_col": 5, "W_learning_rate_multiplier": null, "dim_ordering": "th", "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 128, "b_learning_rate_multiplier": null, "b_regularizer": null, "W_regularizer": null, "activity_regularizer": null, "nb_row": 5}, "inbound_nodes": [[["inception_5a/5x5_zeropadding", 0, 0]]], "name": "inception_5a/5x5"}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "b_constraint": null, "name": "inception_5a/pool_proj", 